api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "anton"], ["email", "antony@moringa.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-22 08:45:14.714471"], ["updated_at", "2023-03-22 08:45:14.714471"]]
---
    def register
        user =User.create(user_params)